<?php
// +----------------------------------------------------------------------
// | Rabbit多商户商城系统
// +----------------------------------------------------------------------
// | Copyright (c) 2022~2026 https://www.rabshop.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed Rabbit多商户商城系统不是自由软件，未经许可不能去掉Rabbit相关版权
// +----------------------------------------------------------------------
// | Author: Rabbit Team <admin@rabshop.cn>
// +----------------------------------------------------------------------

namespace app\common\enum;

enum ChannelEnum
{
    // 美团
    const MEITUAN_TYPE = 'meituan';
    // 饿了么
    const ELEME_TYPE = 'elm';
    // 小程序
    const PROGRAM_TYPE = 'multi';
}
